SELECT * FROM transform( TABLE(select * from intable) scatter randomly );
ERROR:  syntax error at or near "scatter"
LINE 1: ...CT * FROM transform( TABLE(select * from intable) scatter ra...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) ) scatter randomly;
ERROR:  syntax error at or near "scatter"
LINE 1: ... * FROM transform( TABLE(select * from intable) ) scatter ra...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) scatter by a );
ERROR:  syntax error at or near "scatter"
LINE 1: ...CT * FROM transform( TABLE(select * from intable) scatter by...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) ) scatter by a, b;
ERROR:  syntax error at or near "scatter"
LINE 1: ... * FROM transform( TABLE(select * from intable) ) scatter by...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) distributed randomly );
ERROR:  syntax error at or near "distributed"
LINE 1: ...CT * FROM transform( TABLE(select * from intable) distribute...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) ) distributed randomly;
ERROR:  syntax error at or near "distributed"
LINE 1: ... * FROM transform( TABLE(select * from intable) ) distribute...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) distributed by (a) );
ERROR:  syntax error at or near "distributed"
LINE 1: ...CT * FROM transform( TABLE(select * from intable) distribute...
                                                             ^
SELECT * FROM transform( TABLE(select * from intable) ) distributed by (a,b);
ERROR:  syntax error at or near "distributed"
LINE 1: ... * FROM transform( TABLE(select * from intable) ) distribute...
                                                             ^
SELECT id,value FROM intable scatter by id;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT id,value FROM intable scatter by id;
                                     ^
SELECT id,value FROM intable scatter by (id);
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT id,value FROM intable scatter by (id);
                                     ^
SELECT id,value FROM intable scatter randomly;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT id,value FROM intable scatter randomly;
                                     ^
SELECT id,value FROM intable scatter by id,value;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT id,value FROM intable scatter by id,value;
                                     ^
SELECT id,value FROM intable order by id scatter by id;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT id,value FROM intable order by id scatter by id;
                                                 ^
SELECT id,value FROM intable where id < 5 and scatter by id;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT id,value FROM intable where id < 5 and scatter by id;
                                                      ^
SELECT avg(a) FROM t1 scatter by c;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT avg(a) FROM t1 scatter by c;
                              ^
SELECT avg(a) FROM t1 group by c scatter by c;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT avg(a) FROM t1 group by c scatter by c;
                                         ^
SELECT avg(a) FROM t1 group by c having avg(a)>50 scatter by c;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT avg(a) FROM t1 group by c having avg(a)>50 scatter by...
                                                          ^
SELECT a, c, avg(a) over(scatter by c scatter by c) FROM t1 where a <10;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT a, c, avg(a) over(scatter by c scatter by c) FROM t1 ...
                                 ^
SELECT a, c, avg(a) over(partition by c scatter by c) FROM t1 where a <10;
ERROR:  syntax error at or near "scatter"
LINE 1: SELECT a, c, avg(a) over(partition by c scatter by c) FROM t...
                                                ^
